## Quick Reminder:

In [2]:
import pandas as pd

data = {
    'first_name': ['John', 'Markus', 'Tony', 'Howker', 'Luke'],
    'last_name': ['Doe', 'Vasaletti', 'Hawk', 'Mowner', 'McKen'],
    'age': [32, 28, 49, 39, 17],
    'email': ['doejoh@gg.gf', 'valmar@aa.cc', 'thps2@gg.com', 'hawkers@aa.bb', 'ken@kk.og'],
    'occ': ['Dev', 'DB Admin', 'Dev', 'Engineer', 'Tester'],
    'prog_lang': ['Python', 'SQL', 'Python', 'Java; Python', 'C++'],
    'salary': [9000, 8000, 11000, 13000, 5000]
}

df = pd.DataFrame(data)
df.set_index('email', inplace=True)
df

              first_name  last_name  age       occ     prog_lang  salary
email
doejoh@gg.gf        John        Doe   32       Dev        Python    9000
valmar@aa.cc      Markus  Vasaletti   28  DB Admin           SQL    8000
thps2@gg.com        Tony       Hawk   49       Dev        Python   11000
hawkers@aa.bb     Howker     Mowner   39  Engineer  Java; Python   13000
ken@kk.og           Luke      McKen   17    Tester           C++    5000

In [5]:
df.rename(columns={'first_name':'name', 'last_name': 'last'}, inplace=True)

In [20]:
df['prog_lang'].value_counts()

Python          2
C++             1
SQL             1
Java; Python    1
Name: prog_lang, dtype: int64

In [55]:
df[['name', 'salary', 'age']].sort_values(by='salary', ascending=False)

                 name  salary  age
email
hawkers@aa.bb  Howker   13000   39
thps2@gg.com     Tony   11000   49
doejoh@gg.gf     John    9000   32
valmar@aa.cc   Markus    8000   28
ken@kk.og        Luke    5000   17

In [56]:
df

                 name       last  age       occ     prog_lang  salary
email
doejoh@gg.gf     John        Doe   32       Dev        Python    9000
valmar@aa.cc   Markus  Vasaletti   28  DB Admin           SQL    8000
thps2@gg.com     Tony       Hawk   49       Dev        Python   11000
hawkers@aa.bb  Howker     Mowner   39  Engineer  Java; Python   13000
ken@kk.og        Luke        Doe   17    Tester           C++    5000

In [57]:
df['country'] = ['USA', 'Mongolia', 'USA', 'Poland', 'Canada']

In [74]:
#flt = df['prog_lang'].str.contains('Python')
df.groupby('prog_lang').get_group('Python')['country'].value_counts(normalize=True)

USA    1.0
Name: country, dtype: float64

In [87]:
df['country'].value_counts()

USA         2
Canada      1
Mongolia    1
Poland      1
Name: country, dtype: int64